InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_USEBURSTSET.h
/**
 *
 * @file DMA_RegisterDefines_USEBURSTSET.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_USEBURSTSET_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_USEBURSTSET_H_

#include <stdint.h>

/**************************************************************************************
************************************* 10 DMAUSEBURSTSET *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET0_MASK      ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_R_SET0_BIT       ((uint32_t)0u)
#define DMA_DMAUSEBURSTSET_R_SET0_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET0_BURST     ((uint32_t)0x00000001u)

#define DMA_DMAUSEBURSTSET_SET0_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET0_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET0_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET1_MASK      ((uint32_t)0x00000002u)
#define DMA_DMAUSEBURSTSET_R_SET1_BIT       ((uint32_t)1u)
#define DMA_DMAUSEBURSTSET_R_SET1_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET1_BURST     ((uint32_t)0x00000002u)

#define DMA_DMAUSEBURSTSET_SET1_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET1_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET1_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET2_MASK      ((uint32_t)0x00000004u)
#define DMA_DMAUSEBURSTSET_R_SET2_BIT       ((uint32_t)2u)
#define DMA_DMAUSEBURSTSET_R_SET2_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET2_BURST     ((uint32_t)0x00000004u)

#define DMA_DMAUSEBURSTSET_SET2_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET2_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET2_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET3_MASK      ((uint32_t)0x00000008u)
#define DMA_DMAUSEBURSTSET_R_SET3_BIT       ((uint32_t)3u)
#define DMA_DMAUSEBURSTSET_R_SET3_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET3_BURST     ((uint32_t)0x00000008u)

#define DMA_DMAUSEBURSTSET_SET3_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET3_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET3_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET4_MASK      ((uint32_t)0x00000010u)
#define DMA_DMAUSEBURSTSET_R_SET4_BIT       ((uint32_t)4u)
#define DMA_DMAUSEBURSTSET_R_SET4_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET4_BURST     ((uint32_t)0x00000010u)

#define DMA_DMAUSEBURSTSET_SET4_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET4_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET4_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET5_MASK      ((uint32_t)0x00000020u)
#define DMA_DMAUSEBURSTSET_R_SET5_BIT       ((uint32_t)5u)
#define DMA_DMAUSEBURSTSET_R_SET5_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET5_BURST     ((uint32_t)0x00000020u)

#define DMA_DMAUSEBURSTSET_SET5_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET5_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET5_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET6_MASK      ((uint32_t)0x00000040u)
#define DMA_DMAUSEBURSTSET_R_SET6_BIT       ((uint32_t)6u)
#define DMA_DMAUSEBURSTSET_R_SET6_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET6_BURST     ((uint32_t)0x00000040u)

#define DMA_DMAUSEBURSTSET_SET6_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET6_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET6_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET7_MASK      ((uint32_t)0x00000080u)
#define DMA_DMAUSEBURSTSET_R_SET7_BIT       ((uint32_t)7u)
#define DMA_DMAUSEBURSTSET_R_SET7_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET7_BURST     ((uint32_t)0x00000080u)

#define DMA_DMAUSEBURSTSET_SET7_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET7_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET7_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET8_MASK      ((uint32_t)0x00000100u)
#define DMA_DMAUSEBURSTSET_R_SET8_BIT       ((uint32_t)8u)
#define DMA_DMAUSEBURSTSET_R_SET8_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET8_BURST     ((uint32_t)0x00000100u)

#define DMA_DMAUSEBURSTSET_SET8_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET8_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET8_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET9_MASK      ((uint32_t)0x00000200u)
#define DMA_DMAUSEBURSTSET_R_SET9_BIT       ((uint32_t)9u)
#define DMA_DMAUSEBURSTSET_R_SET9_BOTH      ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET9_BURST     ((uint32_t)0x00000200u)

#define DMA_DMAUSEBURSTSET_SET9_MASK        ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET9_BOTH        ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET9_BURST       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET10_MASK     ((uint32_t)0x00000400u)
#define DMA_DMAUSEBURSTSET_R_SET10_BIT      ((uint32_t)10u)
#define DMA_DMAUSEBURSTSET_R_SET10_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET10_BURST    ((uint32_t)0x00000400u)

#define DMA_DMAUSEBURSTSET_SET10_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET10_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET10_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET11_MASK     ((uint32_t)0x00000800u)
#define DMA_DMAUSEBURSTSET_R_SET11_BIT      ((uint32_t)11u)
#define DMA_DMAUSEBURSTSET_R_SET11_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET11_BURST    ((uint32_t)0x00000800u)

#define DMA_DMAUSEBURSTSET_SET11_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET11_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET11_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET12_MASK     ((uint32_t)0x00001000u)
#define DMA_DMAUSEBURSTSET_R_SET12_BIT      ((uint32_t)12u)
#define DMA_DMAUSEBURSTSET_R_SET12_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET12_BURST    ((uint32_t)0x00001000u)

#define DMA_DMAUSEBURSTSET_SET12_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET12_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET12_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET13_MASK     ((uint32_t)0x00002000u)
#define DMA_DMAUSEBURSTSET_R_SET13_BIT      ((uint32_t)13u)
#define DMA_DMAUSEBURSTSET_R_SET13_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET13_BURST    ((uint32_t)0x00002000u)

#define DMA_DMAUSEBURSTSET_SET13_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET13_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET13_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET14_MASK     ((uint32_t)0x00004000u)
#define DMA_DMAUSEBURSTSET_R_SET14_BIT      ((uint32_t)14u)
#define DMA_DMAUSEBURSTSET_R_SET14_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET14_BURST    ((uint32_t)0x00004000u)

#define DMA_DMAUSEBURSTSET_SET14_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET14_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET14_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET15_MASK     ((uint32_t)0x00008000u)
#define DMA_DMAUSEBURSTSET_R_SET15_BIT      ((uint32_t)15u)
#define DMA_DMAUSEBURSTSET_R_SET15_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET15_BURST    ((uint32_t)0x00008000u)

#define DMA_DMAUSEBURSTSET_SET15_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET15_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET15_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET16_MASK     ((uint32_t)0x00010000u)
#define DMA_DMAUSEBURSTSET_R_SET16_BIT      ((uint32_t)16u)
#define DMA_DMAUSEBURSTSET_R_SET16_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET16_BURST    ((uint32_t)0x00010000u)

#define DMA_DMAUSEBURSTSET_SET16_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET16_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET16_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET17_MASK     ((uint32_t)0x00020000u)
#define DMA_DMAUSEBURSTSET_R_SET17_BIT      ((uint32_t)17u)
#define DMA_DMAUSEBURSTSET_R_SET17_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET17_BURST    ((uint32_t)0x00020000u)

#define DMA_DMAUSEBURSTSET_SET17_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET17_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET17_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET18_MASK     ((uint32_t)0x00040000u)
#define DMA_DMAUSEBURSTSET_R_SET18_BIT      ((uint32_t)18u)
#define DMA_DMAUSEBURSTSET_R_SET18_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET18_BURST    ((uint32_t)0x00040000u)

#define DMA_DMAUSEBURSTSET_SET18_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET18_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET18_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET19_MASK     ((uint32_t)0x00080000u)
#define DMA_DMAUSEBURSTSET_R_SET19_BIT      ((uint32_t)19u)
#define DMA_DMAUSEBURSTSET_R_SET19_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET19_BURST    ((uint32_t)0x00080000u)

#define DMA_DMAUSEBURSTSET_SET19_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET19_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET19_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET20_MASK     ((uint32_t)0x00100000u)
#define DMA_DMAUSEBURSTSET_R_SET20_BIT      ((uint32_t)20u)
#define DMA_DMAUSEBURSTSET_R_SET20_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET20_BURST    ((uint32_t)0x00100000u)

#define DMA_DMAUSEBURSTSET_SET20_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET20_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET20_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET21_MASK     ((uint32_t)0x00200000u)
#define DMA_DMAUSEBURSTSET_R_SET21_BIT      ((uint32_t)21u)
#define DMA_DMAUSEBURSTSET_R_SET21_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET21_BURST    ((uint32_t)0x00200000u)

#define DMA_DMAUSEBURSTSET_SET21_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET21_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET21_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET22_MASK     ((uint32_t)0x00400000u)
#define DMA_DMAUSEBURSTSET_R_SET22_BIT      ((uint32_t)22u)
#define DMA_DMAUSEBURSTSET_R_SET22_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET22_BURST    ((uint32_t)0x00400000u)

#define DMA_DMAUSEBURSTSET_SET22_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET22_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET22_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET23_MASK     ((uint32_t)0x00800000u)
#define DMA_DMAUSEBURSTSET_R_SET23_BIT      ((uint32_t)23u)
#define DMA_DMAUSEBURSTSET_R_SET23_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET23_BURST    ((uint32_t)0x00800000u)

#define DMA_DMAUSEBURSTSET_SET23_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET23_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET23_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET24_MASK     ((uint32_t)0x01000000u)
#define DMA_DMAUSEBURSTSET_R_SET24_BIT      ((uint32_t)24u)
#define DMA_DMAUSEBURSTSET_R_SET24_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET24_BURST    ((uint32_t)0x01000000u)

#define DMA_DMAUSEBURSTSET_SET24_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET24_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET24_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET25_MASK     ((uint32_t)0x02000000u)
#define DMA_DMAUSEBURSTSET_R_SET25_BIT      ((uint32_t)25u)
#define DMA_DMAUSEBURSTSET_R_SET25_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET25_BURST    ((uint32_t)0x02000000u)

#define DMA_DMAUSEBURSTSET_SET25_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET25_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET25_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET26_MASK     ((uint32_t)0x04000000u)
#define DMA_DMAUSEBURSTSET_R_SET26_BIT      ((uint32_t)26u)
#define DMA_DMAUSEBURSTSET_R_SET26_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET26_BURST    ((uint32_t)0x04000000u)

#define DMA_DMAUSEBURSTSET_SET26_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET26_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET26_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET27_MASK     ((uint32_t)0x08000000u)
#define DMA_DMAUSEBURSTSET_R_SET27_BIT      ((uint32_t)27u)
#define DMA_DMAUSEBURSTSET_R_SET27_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET27_BURST    ((uint32_t)0x08000000u)

#define DMA_DMAUSEBURSTSET_SET27_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET27_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET27_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET28_MASK     ((uint32_t)0x10000000u)
#define DMA_DMAUSEBURSTSET_R_SET28_BIT      ((uint32_t)28u)
#define DMA_DMAUSEBURSTSET_R_SET28_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET28_BURST    ((uint32_t)0x10000000u)

#define DMA_DMAUSEBURSTSET_SET28_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET28_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET28_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET29_MASK     ((uint32_t)0x20000000u)
#define DMA_DMAUSEBURSTSET_R_SET29_BIT      ((uint32_t)29u)
#define DMA_DMAUSEBURSTSET_R_SET29_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET29_BURST    ((uint32_t)0x20000000u)

#define DMA_DMAUSEBURSTSET_SET29_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET29_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET29_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET30_MASK     ((uint32_t)0x40000000u)
#define DMA_DMAUSEBURSTSET_R_SET30_BIT      ((uint32_t)30u)
#define DMA_DMAUSEBURSTSET_R_SET30_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET30_BURST    ((uint32_t)0x40000000u)

#define DMA_DMAUSEBURSTSET_SET30_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET30_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET30_BURST      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMAUSEBURSTSET_R_SET31_MASK     ((uint32_t)0x80000000u)
#define DMA_DMAUSEBURSTSET_R_SET31_BIT      ((uint32_t)31u)
#define DMA_DMAUSEBURSTSET_R_SET31_BOTH     ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_R_SET31_BURST    ((uint32_t)0x80000000u)

#define DMA_DMAUSEBURSTSET_SET31_MASK       ((uint32_t)0x00000001u)
#define DMA_DMAUSEBURSTSET_SET31_BOTH       ((uint32_t)0x00000000u)
#define DMA_DMAUSEBURSTSET_SET31_BURST      ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_USEBURSTSET_H_ */
